Revit 2024 API
RebarBendData Constructor
 Constructs a new RebarBendData with default settings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public RebarBendData()
Visual Basic
Public Sub New
Visual C++
public:
RebarBendData()
See Also
RebarBendData Class
RebarBendData Overload
Autodesk.Revit.DB.Structure Namespace